; ModuleID = 'main'
source_filename = "main"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-macos-gnu"

%std.macho.mach_header_64 = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%"[][*:0]u8" = type { i8**, i64 }
%"MyComptimeType((struct Options constant))" = type { i32 }
%"MyComptimeType((struct Options constant)).4" = type { i32 }

@_mh_execute_header = weak_odr dso_local unnamed_addr global %std.macho.mach_header_64 undef, align 4
@_MergedGlobals = internal global <{ %"[][*:0]u8", %"[][*:0]u8" }> undef, align 8

; Function Attrs: mustprogress nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #0

; Function Attrs: nobuiltin nounwind
define i32 @main(i32 %0, i8** nonnull %1, i8** nonnull %2) local_unnamed_addr #1 !dbg !1489 {
Entry:
  %ab.i.i.i.i = alloca %"MyComptimeType((struct Options constant))", align 4
  %cd.i.i.i.i = alloca %"MyComptimeType((struct Options constant)).4", align 4
  call void @llvm.dbg.value(metadata i32 %0, metadata !1495, metadata !DIExpression()), !dbg !1505
  call void @llvm.dbg.value(metadata i8** %1, metadata !1496, metadata !DIExpression()), !dbg !1505
  call void @llvm.dbg.value(metadata i8** %2, metadata !1497, metadata !DIExpression()), !dbg !1505
  call void @llvm.dbg.value(metadata i64 0, metadata !1498, metadata !DIExpression()), !dbg !1506
  br label %WhileCond, !dbg !1507


!671 = !DIEnumerator(name: "Unknown", value: 10)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "std.debug.Color", scope: !460, file: !460, line: 489, baseType: !650, size: 8, align: 8, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680}
!674 = !DIEnumerator(name: "Red", value: 0)
!675 = !DIEnumerator(name: "Green", value: 1)
!676 = !DIEnumerator(name: "Cyan", value: 2)
!677 = !DIEnumerator(name: "White", value: 3)
!678 = !DIEnumerator(name: "Dim", value: 4)
!679 = !DIEnumerator(name: "Bold", value: 5)
!680 = !DIEnumerator(name: "Reset", value: 6)
!681 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "@typeInfo(std.dwarf.FormValue).Union.tag_type.?", scope: !682, file: !682, line: 266, baseType: !423, size: 8, align: 8, elements: !683)
!682 = !DIFile(filename: "dwarf.zig", directory: "/Users/jarred/Build/zig/lib/std")
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!684 = !DIEnumerator(name: "Address", value: 0)
!685 = !DIEnumerator(name: "Block", value: 1)
!686 = !DIEnumerator(name: "Const", value: 2)
!687 = !DIEnumerator(name: "ExprLoc", value: 3)
!688 = !DIEnumerator(name: "Flag", value: 4)
!689 = !DIEnumerator(name: "SecOffset", value: 5)
!690 = !DIEnumerator(name: "Ref", value: 6)
!691 = !DIEnumerator(name: "RefAddr", value: 7)
!692 = !DIEnumerator(name: "String", value: 8)
!693 = !DIEnumerator(name: "StrPtr", value: 9)
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "std.fmt.Case", scope: !575, file: !575, line: 785, baseType: !358, size: 8, align: 8, elements: !695)
!695 = !{!696, !697}
!696 = !DIEnumerator(name: "lower", value: 0)
!697 = !DIEnumerator(name: "upper", value: 1)
!698 = !{!699, !702, !704, !707, !717, !719, !721, !739, !747, !750, !778, !785, !787, !789, !791, !793, !795, !797, !799, !801, !803, !805, !807, !810, !812, !814, !816, !820, !823, !826, !828, !830, !832, !834, !836, !838, !851, !863, !866, !869, !871, !873, !875, !878, !880, !882, !884, !886, !888, !900, !902, !904, !906, !909, !912, !914, !916, !919, !921, !923, !925, !927, !929, !931, !933, !935, !937, !939, !941, !943, !946, !948, !1265, !1267, !1269, !1271, !1277, !1281, !1283, !1287, !1290, !1292, !1295, !1297, !1299, !1301, !1303, !1305, !1307, !1309, !1311, !1314, !1316, !1318, !1320, !1322, !1324, !1326, !1328, !1330, !1332, !1334, !1336, !1338, !1340, !1342, !1344, !1346, !1348, !1350, !1352, !1354, !1356, !1358, !1360, !1362, !1368, !1370, !1372, !1374, !1378, !1380, !1382, !1384, !1386, !1388, !1390, !1393, !1395, !1397, !1401, !1403, !1405, !1407, !1410, !1412, !1414, !1416, !1419, !1421, !1424, !1426, !1429, !1431, !1433, !1435, !1437, !1439, !1442, !1445, !1448, !1454, !1456, !1458, !1461, !1463, !1465, !1467, !1471, !1473, !1475, !1477, !1479, !1481, !1483, !1486}
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "zig_backend", linkageName: "zig_backend", scope: !701, file: !701, line: 5, type: !7, isLocal: true, isDefinition: true)
!701 = !DIFile(filename: "builtin.zig", directory: "/Users/jarred/Build/zig-comptime-debug-repro/src/zig-cache/o/2f81cd98bbdc0de6d4d69fff339ee396")
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "output_mode", linkageName: "output_mode", scope: !701, file: !701, line: 11, type: !21, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "link_libc", linkageName: "link_libc", scope: !701, file: !701, line: 106, type: !706, isLocal: true, isDefinition: true)
!706 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "needed_bit_count", linkageName: "needed_bit_count", scope: !709, file: !200, line: 641, type: !716, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.target.Set", scope: !200, file: !200, line: 638, size: 320, align: 64, elements: !710)
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !709, file: !200, line: 639, baseType: !712, size: 320, align: 64)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 320, align: 320, elements: !714)
!713 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!714 = !{!715}
!715 = !DISubrange(count: 5, lowerBound: 0)
!716 = !DIBasicType(name: "u9", size: 16, encoding: DW_ATE_unsigned)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "byte_count", linkageName: "byte_count", scope: !709, file: !200, line: 642, type: !29, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "usize_count", linkageName: "usize_count", scope: !709, file: !200, line: 643, type: !29, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "apple_a14", linkageName: "apple_a14", scope: !723, file: !28, line: 1387, type: !725, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.target.aarch64.cpu", scope: !28, file: !28, line: 1318, elements: !724)
!724 = !{}
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.target.Model", scope: !200, file: !200, line: 1248, size: 640, align: 64, elements: !726)
!726 = !{!727, !733, !738}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !725, file: !200, line: 1249, baseType: !728, size: 128, align: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]u8", size: 128, align: 64, elements: !729)
!729 = !{!730, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !728, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !29, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !728, baseType: !713, size: 64, align: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "llvm_name", scope: !725, file: !200, line: 1250, baseType: !734, size: 136, align: 64, offset: 128)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "?[:0]const u8", size: 192, align: 64, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !734, baseType: !728, size: 128, align: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "maybe", scope: !734, baseType: !706, size: 8, align: 8, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !725, file: !200, line: 1251, baseType: !709, size: 320, align: 64, offset: 320)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "cpu", linkageName: "cpu", scope: !701, file: !701, line: 16, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.target.Cpu", scope: !200, file: !200, line: 607, size: 448, align: 64, elements: !742)
!742 = !{!743, !744, !746}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !741, file: !200, line: 609, baseType: !199, size: 8, align: 8)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !741, file: !200, line: 613, baseType: !745, size: 64, align: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.target.Model", baseType: !725, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !741, file: !200, line: 616, baseType: !709, size: 320, align: 64, offset: 128)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "native_arch", linkageName: "native_arch", scope: !749, file: !749, line: 10, type: !199, isLocal: true, isDefinition: true)
!749 = !DIFile(filename: "start.zig", directory: "/Users/jarred/Build/zig/lib/std")
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "os", linkageName: "os", scope: !701, file: !701, line: 84, type: !752, isLocal: true, isDefinition: true)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.target.Os", scope: !200, file: !200, line: 13, size: 320, align: 32, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !752, file: !200, line: 14, baseType: !260, size: 8, align: 8)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "version_range", scope: !752, file: !200, line: 15, baseType: !756, size: 288, align: 32, offset: 32)
!756 = !DICompositeType(tag: DW_TAG_union_type, name: "std.target.VersionRange", scope: !200, file: !200, line: 221, size: 288, align: 32, elements: !757)
!757 = !{!758, !768, !773}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "semver", scope: !756, file: !200, line: 223, baseType: !759, size: 192, align: 32)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.builtin.Range", scope: !8, file: !8, line: 463, size: 192, align: 32, elements: !760)
!760 = !{!761, !767}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !759, file: !8, line: 464, baseType: !762, size: 96, align: 32)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.builtin.Version", scope: !8, file: !8, line: 458, size: 96, align: 32, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !762, file: !8, line: 459, baseType: !304, size: 32, align: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !762, file: !8, line: 460, baseType: !304, size: 32, align: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !762, file: !8, line: 461, baseType: !304, size: 32, align: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !759, file: !8, line: 465, baseType: !762, size: 96, align: 32, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "linux", scope: !756, file: !200, line: 224, baseType: !769, size: 288, align: 32)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.target.LinuxVersionRange", scope: !200, file: !200, line: 182, size: 288, align: 32, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !769, file: !200, line: 183, baseType: !759, size: 192, align: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "glibc", scope: !769, file: !200, line: 184, baseType: !762, size: 96, align: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "windows", scope: !756, file: !200, line: 225, baseType: !774, size: 64, align: 32)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.target.Range", scope: !200, file: !200, line: 140, size: 64, align: 32, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !774, file: !200, line: 141, baseType: !303, size: 32, align: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !774, file: !200, line: 142, baseType: !303, size: 32, align: 32, offset: 32)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "stack_align", linkageName: "stack_align", scope: !780, file: !200, line: 1324, type: !29, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.target.Target", scope: !200, file: !200, line: 8, size: 832, align: 64, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !780, file: !200, line: 9, baseType: !741, size: 448, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !780, file: !200, line: 10, baseType: !752, size: 320, align: 32, offset: 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "abi", scope: !780, file: !200, line: 11, baseType: !325, size: 8, align: 8, offset: 768)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "mode", linkageName: "mode", scope: !701, file: !701, line: 105, type: !350, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "runtime_safety", linkageName: "runtime_safety", scope: !460, file: !460, line: 23, type: !706, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "enable_segfault_handler", linkageName: "enable_segfault_handler", scope: !460, file: !460, line: 1581, type: !706, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "single_threaded", linkageName: "single_threaded", scope: !701, file: !701, line: 14, type: !706, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "mode", linkageName: "mode", scope: !357, file: !357, line: 25, type: !356, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "is_async", linkageName: "is_async", scope: !357, file: !357, line: 31, type: !706, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "is_windows", linkageName: "is_windows", scope: !639, file: !639, line: 11, type: !706, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "max_format_args", linkageName: "max_format_args", scope: !575, file: !575, line: 371, type: !29, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "default_max_depth", linkageName: "default_max_depth", scope: !575, file: !575, line: 12, type: !29, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "strip_debug_info", linkageName: "strip_debug_info", scope: !701, file: !701, line: 112, type: !706, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "native_os", linkageName: "native_os", scope: !460, file: !460, line: 20, type: !260, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "default_max_load_percentage", linkageName: "default_max_load_percentage", scope: !809, file: !809, line: 124, type: !29, isLocal: true, isDefinition: true)
!809 = !DIFile(filename: "hash_map.zig", directory: "/Users/jarred/Build/zig/lib/std")
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "abi", linkageName: "abi", scope: !701, file: !701, line: 15, type: !325, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "target", linkageName: "target", scope: !701, file: !701, line: 99, type: !780, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "LC_REQ_DYLD", linkageName: "LC_REQ_DYLD", scope: !585, file: !585, line: 889, type: !304, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "page_size", linkageName: "page_size", scope: !818, file: !818, line: 15, type: !819, isLocal: true, isDefinition: true)
!818 = !DIFile(filename: "mem.zig", directory: "/Users/jarred/Build/zig/lib/std")
!819 = !DIBasicType(name: "u15", size: 16, encoding: DW_ATE_unsigned)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "READ", linkageName: "READ", scope: !822, file: !466, line: 592, type: !29, isLocal: true, isDefinition: true)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.c.darwin.PROT", scope: !466, file: !466, line: 588, elements: !724)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "SHARED", linkageName: "SHARED", scope: !825, file: !466, line: 611, type: !29, isLocal: true, isDefinition: true)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.c.darwin.MAP", scope: !466, file: !466, line: 599, elements: !724)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "MH_MAGIC_64", linkageName: "MH_MAGIC_64", scope: !585, file: !585, line: 1056, type: !304, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "N_OSO", linkageName: "N_OSO", scope: !585, file: !585, line: 1289, type: !29, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "N_BNSYM", linkageName: "N_BNSYM", scope: !585, file: !585, line: 1265, type: !29, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "N_FUN", linkageName: "N_FUN", scope: !585, file: !585, line: 1256, type: !29, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "N_ENSYM", linkageName: "N_ENSYM", scope: !585, file: !585, line: 1280, type: !29, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "N_SO", linkageName: "N_SO", scope: !585, file: !585, line: 1286, type: !29, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "minimal_capacity", linkageName: "minimal_capacity", scope: !840, file: !809, line: 705, type: !29, isLocal: true, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.hash_map.HashMapUnmanaged(usize,*std.debug.ModuleDebugInfo,std.hash_map.AutoContext(usize),80)", scope: !809, file: !809, line: 681, size: 128, align: 64, elements: !841)
!841 = !{!842, !849, !850}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !840, file: !809, line: 692, baseType: !843, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.hash_map.Metadata", baseType: !844, size: 64, align: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.hash_map.Metadata", scope: !809, file: !809, line: 744, size: 8, align: 8, elements: !845)
!845 = !{!846, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !844, file: !809, line: 750, baseType: !847, size: 7, align: 8)
!847 = !DIBasicType(name: "u7", size: 8, encoding: DW_ATE_unsigned)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !844, file: !809, line: 751, baseType: !358, size: 1, align: 8, offset: 7)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !840, file: !809, line: 695, baseType: !304, size: 32, align: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !840, file: !809, line: 701, baseType: !304, size: 32, align: 32, offset: 96)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "minimal_capacity", linkageName: "minimal_capacity", scope: !853, file: !809, line: 705, type: !29, isLocal: true, isDefinition: true)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.hash_map.HashMapUnmanaged([]const u8,u64,std.hash_map.StringContext,80)", scope: !809, file: !809, line: 681, size: 128, align: 64, elements: !854)
!854 = !{!855, !861, !862}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !853, file: !809, line: 692, baseType: !856, size: 64, align: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.hash_map.Metadata", baseType: !857, size: 64, align: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.hash_map.Metadata", scope: !809, file: !809, line: 744, size: 8, align: 8, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !857, file: !809, line: 750, baseType: !847, size: 7, align: 8)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !857, file: !809, line: 751, baseType: !358, size: 1, align: 8, offset: 7)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !853, file: !809, line: 695, baseType: !304, size: 32, align: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !853, file: !809, line: 701, baseType: !304, size: 32, align: 32, offset: 96)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "yes", linkageName: "yes", scope: !865, file: !682, line: 141, type: !29, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.dwarf.CHILDREN", scope: !682, file: !682, line: 139, elements: !724)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "subprogram", linkageName: "subprogram", scope: !868, file: !868, line: 42, type: !29, isLocal: true, isDefinition: true)
!868 = !DIFile(filename: "TAG.zig", directory: "/Users/jarred/Build/zig/lib/std/dwarf")
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "inlined_subroutine", linkageName: "inlined_subroutine", scope: !868, file: !868, line: 25, type: !29, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "subroutine", linkageName: "subroutine", scope: !868, file: !868, line: 16, type: !29, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "entry_point", linkageName: "entry_point", scope: !868, file: !868, line: 4, type: !29, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "name", linkageName: "name", scope: !877, file: !877, line: 3, type: !29, isLocal: true, isDefinition: true)
!877 = !DIFile(filename: "AT.zig", directory: "/Users/jarred/Build/zig/lib/std/dwarf")
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "abstract_origin", linkageName: "abstract_origin", scope: !877, file: !877, line: 34, type: !29, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "specification", linkageName: "specification", scope: !877, file: !877, line: 56, type: !29, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "low_pc", linkageName: "low_pc", scope: !877, file: !877, line: 11, type: !29, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "high_pc", linkageName: "high_pc", scope: !877, file: !877, line: 12, type: !29, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "compile_unit", linkageName: "compile_unit", scope: !868, file: !868, line: 13, type: !29, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "minimal_capacity", linkageName: "minimal_capacity", scope: !890, file: !809, line: 705, type: !29, isLocal: true, isDefinition: true)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.hash_map.HashMapUnmanaged([]const u8,std.debug.OFileInfo,std.hash_map.StringContext,80)", scope: !809, file: !809, line: 681, size: 128, align: 64, elements: !891)
!891 = !{!892, !898, !899}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !890, file: !809, line: 692, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.hash_map.Metadata", baseType: !894, size: 64, align: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.hash_map.Metadata", scope: !809, file: !809, line: 744, size: 8, align: 8, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !894, file: !809, line: 750, baseType: !847, size: 7, align: 8)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !894, file: !809, line: 751, baseType: !358, size: 1, align: 8, offset: 7)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !890, file: !809, line: 695, baseType: !304, size: 32, align: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !890, file: !809, line: 701, baseType: !304, size: 32, align: 32, offset: 96)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "ranges", linkageName: "ranges", scope: !877, file: !877, line: 72, type: !29, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "comp_dir", linkageName: "comp_dir", scope: !877, file: !877, line: 21, type: !29, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "stmt_list", linkageName: "stmt_list", scope: !877, file: !877, line: 10, type: !29, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "extended_op", linkageName: "extended_op", scope: !908, file: !682, line: 145, type: !29, isLocal: true, isDefinition: true)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.dwarf.LNS", scope: !682, file: !682, line: 144, elements: !724)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "end_sequence", linkageName: "end_sequence", scope: !911, file: !682, line: 161, type: !29, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.dwarf.LNE", scope: !682, file: !682, line: 160, elements: !724)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "set_address", linkageName: "set_address", scope: !911, file: !682, line: 162, type: !29, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "define_file", linkageName: "define_file", scope: !911, file: !682, line: 163, type: !29, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "native_os", linkageName: "native_os", scope: !918, file: !918, line: 13, type: !260, isLocal: true, isDefinition: true)
!918 = !DIFile(filename: "path.zig", directory: "/Users/jarred/Build/zig/lib/std/fs")
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "sep_posix", linkageName: "sep_posix", scope: !918, file: !918, line: 16, type: !29, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "sep", linkageName: "sep", scope: !918, file: !918, line: 17, type: !29, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "copy", linkageName: "copy", scope: !908, file: !682, line: 146, type: !29, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "advance_pc", linkageName: "advance_pc", scope: !908, file: !682, line: 147, type: !29, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "advance_line", linkageName: "advance_line", scope: !908, file: !682, line: 148, type: !29, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "set_file", linkageName: "set_file", scope: !908, file: !682, line: 149, type: !29, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "set_column", linkageName: "set_column", scope: !908, file: !682, line: 150, type: !29, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "negate_stmt", linkageName: "negate_stmt", scope: !908, file: !682, line: 151, type: !29, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "set_basic_block", linkageName: "set_basic_block", scope: !908, file: !682, line: 152, type: !29, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "const_add_pc", linkageName: "const_add_pc", scope: !908, file: !682, line: 153, type: !29, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "fixed_advance_pc", linkageName: "fixed_advance_pc", scope: !908, file: !682, line: 154, type: !29, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "set_prologue_end", linkageName: "set_prologue_end", scope: !908, file: !682, line: 155, type: !29, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "target", linkageName: "target", scope: !945, file: !945, line: 9, type: !780, isLocal: true, isDefinition: true)
!945 = !DIFile(filename: "Thread.zig", directory: "/Users/jarred/Build/zig/lib/std")
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "use_pthreads", linkageName: "use_pthreads", scope: !945, file: !945, line: 20, type: !706, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "default_instance", linkageName: "default_instance", scope: !950, file: !417, line: 107, type: !1264, isLocal: true, isDefinition: true)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.Loop", scope: !417, file: !417, line: 14, size: 2816, align: 64, elements: !951)
!951 = !{!952, !971, !987, !992, !993, !1008, !1009, !1157, !1158, !1166, !1220, !1245, !1259}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "next_tick_queue", scope: !950, file: !417, line: 15, baseType: !953, size: 128, align: 64)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.atomic.queue.Queue(anyframe)", scope: !954, file: !954, line: 11, size: 128, align: 64, elements: !955)
!954 = !DIFile(filename: "queue.zig", directory: "/Users/jarred/Build/zig/lib/std/atomic")
!955 = !{!956, !970}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !953, file: !954, line: 12, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.linked_list.Node", baseType: !958, size: 64, align: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.linked_list.Node", scope: !959, file: !959, line: 167, size: 192, align: 64, elements: !960)
!959 = !DIFile(filename: "linked_list.zig", directory: "/Users/jarred/Build/zig/lib/std")
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !958, file: !959, line: 168, baseType: !957, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !958, file: !959, line: 169, baseType: !957, size: 64, align: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !958, file: !959, line: 170, baseType: !964, size: 64, align: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "anyframe", baseType: !965, size: 64, align: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "(anyframe header)", size: 192, align: 64, elements: !966)
!966 = !{!967, !968, !969}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "fn_ptr", scope: !964, baseType: !713, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "resume_index", scope: !964, baseType: !713, size: 64, align: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "awaiter", scope: !964, baseType: !713, size: 64, align: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !953, file: !954, line: 13, baseType: !957, size: 64, align: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "os_data", scope: !950, file: !417, line: 16, baseType: !972, size: 320, align: 64, offset: 128)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.KEventData", scope: !417, file: !417, line: 1555, size: 320, align: 64, elements: !973)
!973 = !{!974, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "kqfd", scope: !972, file: !417, line: 1556, baseType: !975, size: 32, align: 32)
!975 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "final_kevent", scope: !972, file: !417, line: 1557, baseType: !977, size: 256, align: 64, offset: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.c.darwin.Kevent", scope: !466, file: !466, line: 524, size: 256, align: 64, elements: !978)
!978 = !{!979, !980, !982, !983, !984, !986}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !977, file: !466, line: 525, baseType: !713, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !977, file: !466, line: 526, baseType: !981, size: 16, align: 16, offset: 64)
!981 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !977, file: !466, line: 527, baseType: !363, size: 16, align: 16, offset: 80)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "fflags", scope: !977, file: !466, line: 528, baseType: !304, size: 32, align: 32, offset: 96)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !977, file: !466, line: 529, baseType: !985, size: 64, align: 64, offset: 128)
!985 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "udata", scope: !977, file: !466, line: 530, baseType: !713, size: 64, align: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "final_resume_node", scope: !950, file: !417, line: 17, baseType: !988, size: 128, align: 64, offset: 448)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.ResumeNode", scope: !417, file: !417, line: 43, size: 128, align: 64, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !988, file: !417, line: 44, baseType: !416, size: 8, align: 8)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !988, file: !417, line: 45, baseType: !964, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pending_event_count", scope: !950, file: !417, line: 18, baseType: !713, size: 64, align: 64, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "extra_threads", scope: !950, file: !417, line: 19, baseType: !994, size: 128, align: 64, offset: 640)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]std.Thread", size: 128, align: 64, elements: !995)
!995 = !{!996, !1007}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !994, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.Thread", baseType: !998, size: 64, align: 64)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.Thread", scope: !945, file: !945, line: 1, size: 64, align: 64, elements: !999)
!999 = !{!1000}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !998, file: !945, line: 33, baseType: !1001, size: 64, align: 64)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.Thread.PosixThreadImpl", scope: !945, file: !945, line: 534, size: 64, align: 64, elements: !1002)
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1001, file: !945, line: 617, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.c.pthread_t", baseType: !1005, size: 64, align: 64)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.c.pthread_t", scope: !1006, file: !1006, line: 339, flags: DIFlagFwdDecl)
!1006 = !DIFile(filename: "c.zig", directory: "/Users/jarred/Build/zig/lib/std")
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !994, baseType: !713, size: 64, align: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "fs_thread", scope: !950, file: !417, line: 24, baseType: !998, size: 64, align: 64, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "fs_queue", scope: !950, file: !417, line: 25, baseType: !1010, size: 128, align: 64, offset: 832)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.atomic.queue.Queue(std.event.loop.Request)", scope: !954, file: !954, line: 11, size: 128, align: 64, elements: !1011)
!1011 = !{!1012, !1156}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1010, file: !954, line: 12, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.linked_list.Node", baseType: !1014, size: 64, align: 64)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.linked_list.Node", scope: !959, file: !959, line: 167, size: 832, align: 64, elements: !1015)
!1015 = !{!1016, !1017, !1018}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1014, file: !959, line: 168, baseType: !1013, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1014, file: !959, line: 169, baseType: !1013, size: 64, align: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1014, file: !959, line: 170, baseType: !1019, size: 704, align: 64, offset: 128)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.Request", scope: !417, file: !417, line: 1566, size: 704, align: 64, elements: !1020)
!1020 = !{!1021, !1148}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !1019, file: !417, line: 1567, baseType: !1022, size: 448, align: 64)
!1022 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.Msg", scope: !417, file: !417, line: 1577, size: 448, align: 64, elements: !1023)
!1023 = !{!1024, !1147}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !1022, file: !417, line: 1577, baseType: !1025, size: 320, align: 64)
!1025 = !DICompositeType(tag: DW_TAG_union_type, name: "AnonUnion", scope: !1022, file: !417, line: 1577, size: 320, align: 64, elements: !1026)
!1026 = !{!1027, !1038, !1054, !1064, !1079, !1090, !1097, !1108, !1115, !1127, !1135, !1139}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !1022, file: !417, line: 1578, baseType: !1028, size: 320, align: 64)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.Read", scope: !417, file: !417, line: 1594, size: 320, align: 64, elements: !1029)
!1029 = !{!1030, !1032, !1033}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1028, file: !417, line: 1595, baseType: !1031, size: 32, align: 32)
!1031 = !DIBasicType(name: "c_int", size: 32, encoding: DW_ATE_signed)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1028, file: !417, line: 1596, baseType: !728, size: 128, align: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1028, file: !417, line: 1597, baseType: !1034, size: 128, align: 64, offset: 192)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.ReadError!usize", size: 128, align: 128, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1034, baseType: !713, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1034, baseType: !362, size: 16, align: 16, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "readv", scope: !1022, file: !417, line: 1579, baseType: !1039, size: 320, align: 64)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.ReadV", scope: !417, file: !417, line: 1602, size: 320, align: 64, elements: !1040)
!1040 = !{!1041, !1042, !1053}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1039, file: !417, line: 1603, baseType: !1031, size: 32, align: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !1039, file: !417, line: 1604, baseType: !1043, size: 128, align: 64, offset: 64)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]std.os.iovec", size: 128, align: 64, elements: !1044)
!1044 = !{!1045, !1052}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1043, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.os.iovec", baseType: !1047, size: 64, align: 64)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.iovec", scope: !1048, file: !1048, line: 182, size: 128, align: 64, elements: !1049)
!1048 = !DIFile(filename: "os.zig", directory: "/Users/jarred/Build/zig/lib/std")
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !1047, file: !1048, line: 183, baseType: !731, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !1047, file: !1048, line: 184, baseType: !713, size: 64, align: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1043, baseType: !713, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1039, file: !417, line: 1605, baseType: !1034, size: 128, align: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !1022, file: !417, line: 1580, baseType: !1055, size: 320, align: 64)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.Write", scope: !417, file: !417, line: 1610, size: 320, align: 64, elements: !1056)
!1056 = !{!1057, !1058, !1059}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1055, file: !417, line: 1611, baseType: !1031, size: 32, align: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !1055, file: !417, line: 1612, baseType: !728, size: 128, align: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1055, file: !417, line: 1613, baseType: !1060, size: 128, align: 64, offset: 192)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.WriteError!usize", size: 128, align: 128, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1060, baseType: !713, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1060, baseType: !362, size: 16, align: 16, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "writev", scope: !1022, file: !417, line: 1581, baseType: !1065, size: 320, align: 64)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.WriteV", scope: !417, file: !417, line: 1618, size: 320, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1078}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1065, file: !417, line: 1619, baseType: !1031, size: 32, align: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !1065, file: !417, line: 1620, baseType: !1069, size: 128, align: 64, offset: 64)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]std.os.iovec_const", size: 128, align: 64, elements: !1070)
!1070 = !{!1071, !1077}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1069, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.os.iovec_const", baseType: !1073, size: 64, align: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.iovec_const", scope: !1048, file: !1048, line: 187, size: 128, align: 64, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !1073, file: !1048, line: 188, baseType: !731, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !1073, file: !1048, line: 189, baseType: !713, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1069, baseType: !713, size: 64, align: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1065, file: !417, line: 1621, baseType: !1060, size: 128, align: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pwrite", scope: !1022, file: !417, line: 1582, baseType: !1080, size: 384, align: 64)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.PWrite", scope: !417, file: !417, line: 1626, size: 384, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1080, file: !417, line: 1627, baseType: !1031, size: 32, align: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !1080, file: !417, line: 1628, baseType: !728, size: 128, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1080, file: !417, line: 1629, baseType: !713, size: 64, align: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1080, file: !417, line: 1630, baseType: !1086, size: 128, align: 64, offset: 256)
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.PWriteError!usize", size: 128, align: 128, elements: !1087)
!1087 = !{!1088, !1089}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1086, baseType: !713, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1086, baseType: !362, size: 16, align: 16, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pwritev", scope: !1022, file: !417, line: 1583, baseType: !1091, size: 384, align: 64)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.PWriteV", scope: !417, file: !417, line: 1635, size: 384, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1095, !1096}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1091, file: !417, line: 1636, baseType: !1031, size: 32, align: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !1091, file: !417, line: 1637, baseType: !1069, size: 128, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1091, file: !417, line: 1638, baseType: !713, size: 64, align: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1091, file: !417, line: 1639, baseType: !1086, size: 128, align: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pread", scope: !1022, file: !417, line: 1584, baseType: !1098, size: 384, align: 64)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.PRead", scope: !417, file: !417, line: 1644, size: 384, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1098, file: !417, line: 1645, baseType: !1031, size: 32, align: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1098, file: !417, line: 1646, baseType: !728, size: 128, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1098, file: !417, line: 1647, baseType: !713, size: 64, align: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1098, file: !417, line: 1648, baseType: !1104, size: 128, align: 64, offset: 256)
!1104 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.PReadError!usize", size: 128, align: 128, elements: !1105)
!1105 = !{!1106, !1107}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1104, baseType: !713, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1104, baseType: !362, size: 16, align: 16, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "preadv", scope: !1022, file: !417, line: 1585, baseType: !1109, size: 384, align: 64)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.PReadV", scope: !417, file: !417, line: 1653, size: 384, align: 64, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1109, file: !417, line: 1654, baseType: !1031, size: 32, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !1109, file: !417, line: 1655, baseType: !1043, size: 128, align: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1109, file: !417, line: 1656, baseType: !713, size: 64, align: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1109, file: !417, line: 1657, baseType: !1104, size: 128, align: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !1022, file: !417, line: 1586, baseType: !1116, size: 192, align: 64)
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.Open", scope: !417, file: !417, line: 1662, size: 192, align: 64, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1122}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1116, file: !417, line: 1663, baseType: !731, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1116, file: !417, line: 1664, baseType: !304, size: 32, align: 32, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1116, file: !417, line: 1665, baseType: !1121, size: 32, align: 32, offset: 96)
!1121 = !DIBasicType(name: "c_uint", size: 32, encoding: DW_ATE_unsigned)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1116, file: !417, line: 1666, baseType: !1123, size: 64, align: 32, offset: 128)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.os.OpenError!c_int", size: 64, align: 64, elements: !1124)
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1123, baseType: !1031, size: 32, align: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1123, baseType: !362, size: 16, align: 16, offset: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "openat", scope: !1022, file: !417, line: 1587, baseType: !1128, size: 256, align: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.OpenAt", scope: !417, file: !417, line: 1671, size: 256, align: 64, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1128, file: !417, line: 1672, baseType: !1031, size: 32, align: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1128, file: !417, line: 1673, baseType: !731, size: 64, align: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1128, file: !417, line: 1674, baseType: !304, size: 32, align: 32, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1128, file: !417, line: 1675, baseType: !1121, size: 32, align: 32, offset: 160)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1128, file: !417, line: 1676, baseType: !1123, size: 64, align: 32, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1022, file: !417, line: 1588, baseType: !1136, size: 32, align: 32)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.Close", scope: !417, file: !417, line: 1681, size: 32, align: 32, elements: !1137)
!1137 = !{!1138}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1136, file: !417, line: 1682, baseType: !1031, size: 32, align: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "faccessat", scope: !1022, file: !417, line: 1589, baseType: !1140, size: 256, align: 64)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.FAccessAt", scope: !417, file: !417, line: 1685, size: 256, align: 64, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "dirfd", scope: !1140, file: !417, line: 1686, baseType: !1031, size: 32, align: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1140, file: !417, line: 1687, baseType: !731, size: 64, align: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1140, file: !417, line: 1688, baseType: !304, size: 32, align: 32, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1140, file: !417, line: 1689, baseType: !304, size: 32, align: 32, offset: 160)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1140, file: !417, line: 1690, baseType: !362, size: 16, align: 16, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1022, file: !417, line: 1577, baseType: !422, size: 4, align: 8, offset: 384)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !1019, file: !417, line: 1568, baseType: !1149, size: 256, align: 64, offset: 448)
!1149 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.Finish", scope: !417, file: !417, line: 1572, size: 256, align: 64, elements: !1150)
!1150 = !{!1151, !1155}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !1149, file: !417, line: 1572, baseType: !1152, size: 192, align: 64)
!1152 = !DICompositeType(tag: DW_TAG_union_type, name: "AnonUnion", scope: !1149, file: !417, line: 1572, size: 192, align: 64, elements: !1153)
!1153 = !{!1154}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "TickNode", scope: !1149, file: !417, line: 1573, baseType: !958, size: 192, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1149, file: !417, line: 1572, baseType: !438, size: 1, align: 8, offset: 192)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1010, file: !954, line: 13, baseType: !1013, size: 64, align: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "fs_end_request", scope: !950, file: !417, line: 26, baseType: !1014, size: 832, align: 64, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "fs_thread_wakeup", scope: !950, file: !417, line: 27, baseType: !1159, size: 8, align: 8, offset: 1792)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.Thread.ResetEvent", scope: !1160, file: !1160, line: 1, size: 8, align: 8, elements: !1161)
!1160 = !DIFile(filename: "ResetEvent.zig", directory: "/Users/jarred/Build/zig/lib/std/Thread")
!1161 = !{!1162}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !1159, file: !1160, line: 18, baseType: !1163, size: 8, align: 8)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.Thread.StaticResetEvent.DebugEvent", scope: !443, file: !443, line: 65, size: 8, align: 8, elements: !1164)
!1164 = !{!1165}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1163, file: !443, line: 66, baseType: !442, size: 8, align: 8)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !950, file: !417, line: 31, baseType: !1167, size: 256, align: 64, offset: 1856)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.heap.arena_allocator.ArenaAllocator", scope: !1168, file: !1168, line: 8, size: 256, align: 64, elements: !1169)
!1168 = !DIFile(filename: "arena_allocator.zig", directory: "/Users/jarred/Build/zig/lib/std/heap")
!1169 = !{!1170, !1207}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "child_allocator", scope: !1167, file: !1168, line: 9, baseType: !1171, size: 128, align: 64)
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.mem.Allocator", scope: !645, file: !645, line: 1, size: 128, align: 64, elements: !1172)
!1172 = !{!1173, !1176}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1171, file: !645, line: 13, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*anyopaque", baseType: !1175, size: 64, align: 64)
!1175 = !DICompositeType(tag: DW_TAG_structure_type, name: "anyopaque", flags: DIFlagFwdDecl)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1171, file: !645, line: 14, baseType: !1177, size: 64, align: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.mem.Allocator.VTable", baseType: !1178, size: 64, align: 64)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.mem.Allocator.VTable", scope: !645, file: !645, line: 16, size: 192, align: 64, elements: !1179)
!1179 = !{!1180, !1191, !1202}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1178, file: !645, line: 26, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const fn(*anyopaque, usize, u29, u29, usize) std.mem.Allocator.Error![]u8", baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 8, align: 8)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{null, !1185, !1174, !713, !1190, !1190, !713}
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.mem.Allocator.Error![]u8", baseType: !1186, size: 64, align: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.mem.Allocator.Error![]u8", size: 192, align: 192, elements: !1187)
!1187 = !{!1188, !1189}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1186, baseType: !728, size: 128, align: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1186, baseType: !362, size: 16, align: 16, offset: 128)
!1190 = !DIBasicType(name: "u29", size: 32, encoding: DW_ATE_unsigned)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "resize", scope: !1178, file: !645, line: 45, baseType: !1192, size: 64, align: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const fn(*anyopaque, []u8, u29, usize, u29, usize) ?usize", baseType: !1193, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 8, align: 8)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{null, !1196, !1174, !1201, !1190, !713, !1190, !713}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*?usize", baseType: !1197, size: 64, align: 64)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "?usize", size: 128, align: 64, elements: !1198)
!1198 = !{!1199, !1200}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1197, baseType: !713, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "maybe", scope: !1197, baseType: !706, size: 8, align: 8, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[]u8", baseType: !728, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1178, file: !645, line: 52, baseType: !1203, size: 64, align: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const fn(*anyopaque, []u8, u29, usize) void", baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 8, align: 8)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{null, !1174, !1201, !1190, !713}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1167, file: !1168, line: 10, baseType: !1208, size: 128, align: 64, offset: 128)
!1208 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.heap.arena_allocator.State", scope: !1168, file: !1168, line: 14, size: 128, align: 64, elements: !1209)
!1209 = !{!1210, !1219}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_list", scope: !1208, file: !1168, line: 15, baseType: !1211, size: 64, align: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.linked_list.SinglyLinkedList([]u8)", scope: !959, file: !959, line: 16, size: 64, align: 64, elements: !1212)
!1212 = !{!1213}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1211, file: !959, line: 68, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.linked_list.Node", baseType: !1215, size: 64, align: 64)
!1215 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.linked_list.Node", scope: !959, file: !959, line: 20, size: 192, align: 64, elements: !1216)
!1216 = !{!1217, !1218}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1215, file: !959, line: 21, baseType: !1214, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1215, file: !959, line: 22, baseType: !728, size: 128, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "end_index", scope: !1208, file: !1168, line: 16, baseType: !713, size: 64, align: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "delay_queue", scope: !950, file: !417, line: 34, baseType: !1221, size: 512, align: 64, offset: 2112)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.DelayQueue", scope: !417, file: !417, line: 845, size: 512, align: 64, elements: !1222)
!1222 = !{!1223, !1234, !1238, !1239, !1244}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !1221, file: !417, line: 846, baseType: !1224, size: 192, align: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.time.Timer", scope: !1225, file: !1225, line: 138, size: 192, align: 64, elements: !1226)
!1225 = !DIFile(filename: "time.zig", directory: "/Users/jarred/Build/zig/lib/std")
!1226 = !{!1227, !1232, !1233}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1224, file: !1225, line: 142, baseType: !1228, size: 64, align: 32)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.c.darwin.mach_timebase_info_data", scope: !466, file: !466, line: 331, size: 64, align: 32, elements: !1229)
!1229 = !{!1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "numer", scope: !1228, file: !466, line: 332, baseType: !304, size: 32, align: 32)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "denom", scope: !1228, file: !466, line: 333, baseType: !304, size: 32, align: 32, offset: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !1224, file: !1225, line: 147, baseType: !9, size: 64, align: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !1224, file: !1225, line: 148, baseType: !9, size: 64, align: 64, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "waiters", scope: !1221, file: !417, line: 847, baseType: !1235, size: 128, align: 64, offset: 192)
!1235 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.Waiters", scope: !417, file: !417, line: 892, size: 128, align: 64, elements: !1236)
!1236 = !{!1237}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1235, file: !417, line: 893, baseType: !953, size: 128, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !1221, file: !417, line: 848, baseType: !998, size: 64, align: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1221, file: !417, line: 849, baseType: !1240, size: 64, align: 64, offset: 384)
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.Thread.AutoResetEvent", scope: !1241, file: !1241, line: 1, size: 64, align: 64, elements: !1242)
!1241 = !DIFile(filename: "AutoResetEvent.zig", directory: "/Users/jarred/Build/zig/lib/std/Thread")
!1242 = !{!1243}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1240, file: !1241, line: 26, baseType: !713, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !1221, file: !417, line: 850, baseType: !706, size: 8, align: 8, offset: 448)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "available_eventfd_resume_nodes", scope: !950, file: !417, line: 38, baseType: !1246, size: 64, align: 64, offset: 2624)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.atomic.stack.Stack(std.event.loop.KEventFd)", scope: !1247, file: !1247, line: 10, size: 64, align: 64, elements: !1248)
!1247 = !DIFile(filename: "stack.zig", directory: "/Users/jarred/Build/zig/lib/std/atomic")
!1248 = !{!1249}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1246, file: !1247, line: 11, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.atomic.stack.Node", baseType: !1251, size: 64, align: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.atomic.stack.Node", scope: !1247, file: !1247, line: 18, size: 448, align: 64, elements: !1252)
!1252 = !{!1253, !1254}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1251, file: !1247, line: 19, baseType: !1250, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1251, file: !1247, line: 20, baseType: !1255, size: 384, align: 64, offset: 64)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.event.loop.KEventFd", scope: !417, file: !417, line: 84, size: 384, align: 64, elements: !1256)
!1256 = !{!1257, !1258}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1255, file: !417, line: 85, baseType: !988, size: 128, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "kevent", scope: !1255, file: !417, line: 86, baseType: !977, size: 256, align: 64, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "eventfd_resume_nodes", scope: !950, file: !417, line: 39, baseType: !1260, size: 128, align: 64, offset: 2688)
!1260 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]std.atomic.stack.Node", size: 128, align: 64, elements: !1261)
!1261 = !{!1262, !1263}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1260, baseType: !1250, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1260, baseType: !713, size: 64, align: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*std.event.loop.Loop", baseType: !950, size: 64, align: 64)
!1265 = !DIGlobalVariableExpression(var: !1266, expr: !DIExpression())
!1266 = distinct !DIGlobalVariable(name: "instance", linkageName: "instance", scope: !950, file: !417, line: 111, type: !1264, isLocal: true, isDefinition: true)
!1267 = !DIGlobalVariableExpression(var: !1268, expr: !DIExpression())
!1268 = distinct !DIGlobalVariable(name: "STDERR_FILENO", linkageName: "STDERR_FILENO", scope: !466, file: !466, line: 586, type: !29, isLocal: true, isDefinition: true)
!1269 = !DIGlobalVariableExpression(var: !1270, expr: !DIExpression())
!1270 = distinct !DIGlobalVariable(name: "STDERR_FILENO", linkageName: "STDERR_FILENO", scope: !1048, file: !1048, line: 116, type: !29, isLocal: true, isDefinition: true)
!1271 = !DIGlobalVariableExpression(var: !1272, expr: !DIExpression())
!1272 = distinct !DIGlobalVariable(name: "ANY", linkageName: "ANY", scope: !575, file: !575, line: 426, type: !1273, isLocal: true, isDefinition: true)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[3:0]u8", baseType: !1274, size: 64, align: 64)
!1274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 32, align: 32, elements: !1275)
!1275 = !{!1276}
!1276 = !DISubrange(count: 4, lowerBound: 0)
!1277 = !DIGlobalVariableExpression(var: !1278, expr: !DIExpression())
!1278 = distinct !DIGlobalVariable(name: "vtable", linkageName: "vtable", scope: !1279, file: !1280, line: 254, type: !1178, isLocal: true, isDefinition: true)
!1279 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.heap.PageAllocator", scope: !1280, file: !1280, line: 253, elements: !724)
!1280 = !DIFile(filename: "heap.zig", directory: "/Users/jarred/Build/zig/lib/std")
!1281 = !DIGlobalVariableExpression(var: !1282, expr: !DIExpression())
!1282 = distinct !DIGlobalVariable(name: "page_allocator", linkageName: "page_allocator", scope: !1280, file: !1280, line: 230, type: !1171, isLocal: true, isDefinition: true)
!1283 = !DIGlobalVariableExpression(var: !1284, expr: !DIExpression())
!1284 = distinct !DIGlobalVariable(name: "FDCWD", linkageName: "FDCWD", scope: !1285, file: !466, line: 1511, type: !1286, isLocal: true, isDefinition: true)
!1285 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.c.darwin.AT", scope: !466, file: !466, line: 1510, elements: !724)
!1286 = !DIBasicType(name: "i65", size: 128, encoding: DW_ATE_signed)
!1287 = !DIGlobalVariableExpression(var: !1288, expr: !DIExpression())
!1288 = distinct !DIGlobalVariable(name: "PATH_MAX", linkageName: "PATH_MAX", scope: !466, file: !466, line: 581, type: !1289, isLocal: true, isDefinition: true)
!1289 = !DIBasicType(name: "u11", size: 16, encoding: DW_ATE_unsigned)
!1290 = !DIGlobalVariableExpression(var: !1291, expr: !DIExpression())
!1291 = distinct !DIGlobalVariable(name: "PATH_MAX", linkageName: "PATH_MAX", scope: !1048, file: !1048, line: 96, type: !1289, isLocal: true, isDefinition: true)
!1292 = !DIGlobalVariableExpression(var: !1293, expr: !DIExpression())
!1293 = distinct !DIGlobalVariable(name: "MAX_PATH_BYTES", linkageName: "MAX_PATH_BYTES", scope: !1294, file: !1294, line: 36, type: !1289, isLocal: true, isDefinition: true)
!1294 = !DIFile(filename: "fs.zig", directory: "/Users/jarred/Build/zig/lib/std")
!1295 = !DIGlobalVariableExpression(var: !1296, expr: !DIExpression())
!1296 = distinct !DIGlobalVariable(name: "MAX_PATH_BYTES", linkageName: "MAX_PATH_BYTES", scope: !1048, file: !1048, line: 25, type: !1289, isLocal: true, isDefinition: true)
!1297 = !DIGlobalVariableExpression(var: !1298, expr: !DIExpression())
!1298 = distinct !DIGlobalVariable(name: "page_size", linkageName: "page_size", scope: !1006, file: !1006, line: 4, type: !819, isLocal: true, isDefinition: true)
!1299 = !DIGlobalVariableExpression(var: !1300, expr: !DIExpression())
!1300 = distinct !DIGlobalVariable(name: "FAILED", linkageName: "FAILED", scope: !825, file: !466, line: 616, type: !1174, isLocal: true, isDefinition: true)
!1301 = !DIGlobalVariableExpression(var: !1302, expr: !DIExpression())
!1302 = distinct !DIGlobalVariable(name: "N_STAB", linkageName: "N_STAB", scope: !585, file: !585, line: 1220, type: !29, isLocal: true, isDefinition: true)
!1303 = !DIGlobalVariableExpression(var: !1304, expr: !DIExpression())
!1304 = distinct !DIGlobalVariable(name: "N_TYPE", linkageName: "N_TYPE", scope: !585, file: !585, line: 1226, type: !29, isLocal: true, isDefinition: true)
!1305 = !DIGlobalVariableExpression(var: !1306, expr: !DIExpression())
!1306 = distinct !DIGlobalVariable(name: "N_UNDF", linkageName: "N_UNDF", scope: !585, file: !585, line: 1232, type: !29, isLocal: true, isDefinition: true)
!1307 = !DIGlobalVariableExpression(var: !1308, expr: !DIExpression())
!1308 = distinct !DIGlobalVariable(name: "N_ABS", linkageName: "N_ABS", scope: !585, file: !585, line: 1235, type: !29, isLocal: true, isDefinition: true)
!1309 = !DIGlobalVariableExpression(var: !1310, expr: !DIExpression())
!1310 = distinct !DIGlobalVariable(name: "native_endian", linkageName: "native_endian", scope: !818, file: !818, line: 11, type: !448, isLocal: true, isDefinition: true)
!1311 = !DIGlobalVariableExpression(var: !1312, expr: !DIExpression())
!1312 = distinct !DIGlobalVariable(name: "addr", linkageName: "addr", scope: !1313, file: !682, line: 16, type: !29, isLocal: true, isDefinition: true)
!1313 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.dwarf.FORM", scope: !682, file: !682, line: 15, elements: !724)
!1314 = !DIGlobalVariableExpression(var: !1315, expr: !DIExpression())
!1315 = distinct !DIGlobalVariable(name: "block1", linkageName: "block1", scope: !1313, file: !682, line: 24, type: !29, isLocal: true, isDefinition: true)
!1316 = !DIGlobalVariableExpression(var: !1317, expr: !DIExpression())
!1317 = distinct !DIGlobalVariable(name: "block2", linkageName: "block2", scope: !1313, file: !682, line: 17, type: !29, isLocal: true, isDefinition: true)
!1318 = !DIGlobalVariableExpression(var: !1319, expr: !DIExpression())
!1319 = distinct !DIGlobalVariable(name: "block4", linkageName: "block4", scope: !1313, file: !682, line: 18, type: !29, isLocal: true, isDefinition: true)
!1320 = !DIGlobalVariableExpression(var: !1321, expr: !DIExpression())
!1321 = distinct !DIGlobalVariable(name: "block", linkageName: "block", scope: !1313, file: !682, line: 23, type: !29, isLocal: true, isDefinition: true)
!1322 = !DIGlobalVariableExpression(var: !1323, expr: !DIExpression())
!1323 = distinct !DIGlobalVariable(name: "data1", linkageName: "data1", scope: !1313, file: !682, line: 25, type: !29, isLocal: true, isDefinition: true)
!1324 = !DIGlobalVariableExpression(var: !1325, expr: !DIExpression())
!1325 = distinct !DIGlobalVariable(name: "data2", linkageName: "data2", scope: !1313, file: !682, line: 19, type: !29, isLocal: true, isDefinition: true)
!1326 = !DIGlobalVariableExpression(var: !1327, expr: !DIExpression())
!1327 = distinct !DIGlobalVariable(name: "data4", linkageName: "data4", scope: !1313, file: !682, line: 20, type: !29, isLocal: true, isDefinition: true)
!1328 = !DIGlobalVariableExpression(var: !1329, expr: !DIExpression())
!1329 = distinct !DIGlobalVariable(name: "data8", linkageName: "data8", scope: !1313, file: !682, line: 21, type: !29, isLocal: true, isDefinition: true)
!1330 = !DIGlobalVariableExpression(var: !1331, expr: !DIExpression())
!1331 = distinct !DIGlobalVariable(name: "udata", linkageName: "udata", scope: !1313, file: !682, line: 29, type: !29, isLocal: true, isDefinition: true)
!1332 = !DIGlobalVariableExpression(var: !1333, expr: !DIExpression())
!1333 = distinct !DIGlobalVariable(name: "sdata", linkageName: "sdata", scope: !1313, file: !682, line: 27, type: !29, isLocal: true, isDefinition: true)
!1334 = !DIGlobalVariableExpression(var: !1335, expr: !DIExpression())
!1335 = distinct !DIGlobalVariable(name: "exprloc", linkageName: "exprloc", scope: !1313, file: !682, line: 38, type: !29, isLocal: true, isDefinition: true)
!1336 = !DIGlobalVariableExpression(var: !1337, expr: !DIExpression())
!1337 = distinct !DIGlobalVariable(name: "flag", linkageName: "flag", scope: !1313, file: !682, line: 26, type: !29, isLocal: true, isDefinition: true)
!1338 = !DIGlobalVariableExpression(var: !1339, expr: !DIExpression())
!1339 = distinct !DIGlobalVariable(name: "flag_present", linkageName: "flag_present", scope: !1313, file: !682, line: 39, type: !29, isLocal: true, isDefinition: true)
!1340 = !DIGlobalVariableExpression(var: !1341, expr: !DIExpression())
!1341 = distinct !DIGlobalVariable(name: "sec_offset", linkageName: "sec_offset", scope: !1313, file: !682, line: 37, type: !29, isLocal: true, isDefinition: true)
!1342 = !DIGlobalVariableExpression(var: !1343, expr: !DIExpression())
!1343 = distinct !DIGlobalVariable(name: "ref1", linkageName: "ref1", scope: !1313, file: !682, line: 31, type: !29, isLocal: true, isDefinition: true)
!1344 = !DIGlobalVariableExpression(var: !1345, expr: !DIExpression())
!1345 = distinct !DIGlobalVariable(name: "ref2", linkageName: "ref2", scope: !1313, file: !682, line: 32, type: !29, isLocal: true, isDefinition: true)
!1346 = !DIGlobalVariableExpression(var: !1347, expr: !DIExpression())
!1347 = distinct !DIGlobalVariable(name: "ref4", linkageName: "ref4", scope: !1313, file: !682, line: 33, type: !29, isLocal: true, isDefinition: true)
!1348 = !DIGlobalVariableExpression(var: !1349, expr: !DIExpression())
!1349 = distinct !DIGlobalVariable(name: "ref8", linkageName: "ref8", scope: !1313, file: !682, line: 34, type: !29, isLocal: true, isDefinition: true)
!1350 = !DIGlobalVariableExpression(var: !1351, expr: !DIExpression())
!1351 = distinct !DIGlobalVariable(name: "ref_udata", linkageName: "ref_udata", scope: !1313, file: !682, line: 35, type: !29, isLocal: true, isDefinition: true)
!1352 = !DIGlobalVariableExpression(var: !1353, expr: !DIExpression())
!1353 = distinct !DIGlobalVariable(name: "ref_addr", linkageName: "ref_addr", scope: !1313, file: !682, line: 30, type: !29, isLocal: true, isDefinition: true)
!1354 = !DIGlobalVariableExpression(var: !1355, expr: !DIExpression())
!1355 = distinct !DIGlobalVariable(name: "ref_sig8", linkageName: "ref_sig8", scope: !1313, file: !682, line: 40, type: !29, isLocal: true, isDefinition: true)
!1356 = !DIGlobalVariableExpression(var: !1357, expr: !DIExpression())
!1357 = distinct !DIGlobalVariable(name: "string", linkageName: "string", scope: !1313, file: !682, line: 22, type: !29, isLocal: true, isDefinition: true)
!1358 = !DIGlobalVariableExpression(var: !1359, expr: !DIExpression())
!1359 = distinct !DIGlobalVariable(name: "strp", linkageName: "strp", scope: !1313, file: !682, line: 28, type: !29, isLocal: true, isDefinition: true)
!1360 = !DIGlobalVariableExpression(var: !1361, expr: !DIExpression())
!1361 = distinct !DIGlobalVariable(name: "indirect", linkageName: "indirect", scope: !1313, file: !682, line: 36, type: !29, isLocal: true, isDefinition: true)
!1362 = !DIGlobalVariableExpression(var: !1363, expr: !DIExpression())
!1363 = distinct !DIGlobalVariable(name: "RED", linkageName: "RED", scope: !460, file: !460, line: 331, type: !1364, isLocal: true, isDefinition: true)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[7:0]u8", baseType: !1365, size: 64, align: 64)
!1365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, align: 64, elements: !1366)
!1366 = !{!1367}
!1367 = !DISubrange(count: 8, lowerBound: 0)
!1368 = !DIGlobalVariableExpression(var: !1369, expr: !DIExpression())
!1369 = distinct !DIGlobalVariable(name: "GREEN", linkageName: "GREEN", scope: !460, file: !460, line: 332, type: !1364, isLocal: true, isDefinition: true)
!1370 = !DIGlobalVariableExpression(var: !1371, expr: !DIExpression())
!1371 = distinct !DIGlobalVariable(name: "CYAN", linkageName: "CYAN", scope: !460, file: !460, line: 333, type: !1364, isLocal: true, isDefinition: true)
!1372 = !DIGlobalVariableExpression(var: !1373, expr: !DIExpression())
!1373 = distinct !DIGlobalVariable(name: "WHITE", linkageName: "WHITE", scope: !460, file: !460, line: 334, type: !1364, isLocal: true, isDefinition: true)
!1374 = !DIGlobalVariableExpression(var: !1375, expr: !DIExpression())
!1375 = distinct !DIGlobalVariable(name: "DIM", linkageName: "DIM", scope: !460, file: !460, line: 336, type: !1376, isLocal: true, isDefinition: true)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[4:0]u8", baseType: !1377, size: 64, align: 64)
!1377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 40, align: 40, elements: !714)
!1378 = !DIGlobalVariableExpression(var: !1379, expr: !DIExpression())
!1379 = distinct !DIGlobalVariable(name: "BOLD", linkageName: "BOLD", scope: !460, file: !460, line: 335, type: !1376, isLocal: true, isDefinition: true)
!1380 = !DIGlobalVariableExpression(var: !1381, expr: !DIExpression())
!1381 = distinct !DIGlobalVariable(name: "RESET", linkageName: "RESET", scope: !460, file: !460, line: 337, type: !1376, isLocal: true, isDefinition: true)
!1382 = !DIGlobalVariableExpression(var: !1383, expr: !DIExpression())
!1383 = distinct !DIGlobalVariable(name: "native_arch", linkageName: "native_arch", scope: !460, file: !460, line: 19, type: !199, isLocal: true, isDefinition: true)
!1384 = !DIGlobalVariableExpression(var: !1385, expr: !DIExpression())
!1385 = distinct !DIGlobalVariable(name: "unexpected_error_tracing", linkageName: "unexpected_error_tracing", scope: !1048, file: !1048, line: 4976, type: !706, isLocal: true, isDefinition: true)
!1386 = !DIGlobalVariableExpression(var: !1387, expr: !DIExpression())
!1387 = distinct !DIGlobalVariable(name: "WRITE", linkageName: "WRITE", scope: !822, file: !466, line: 594, type: !29, isLocal: true, isDefinition: true)
!1388 = !DIGlobalVariableExpression(var: !1389, expr: !DIExpression())
!1389 = distinct !DIGlobalVariable(name: "PRIVATE", linkageName: "PRIVATE", scope: !825, file: !466, line: 609, type: !29, isLocal: true, isDefinition: true)
!1390 = !DIGlobalVariableExpression(var: !1391, expr: !DIExpression())
!1391 = distinct !DIGlobalVariable(name: "ANONYMOUS", linkageName: "ANONYMOUS", scope: !825, file: !466, line: 601, type: !1392, isLocal: true, isDefinition: true)
!1392 = !DIBasicType(name: "u13", size: 16, encoding: DW_ATE_unsigned)
!1393 = !DIGlobalVariableExpression(var: !1394, expr: !DIExpression())
!1394 = distinct !DIGlobalVariable(name: "STDOUT_FILENO", linkageName: "STDOUT_FILENO", scope: !466, file: !466, line: 585, type: !29, isLocal: true, isDefinition: true)
!1395 = !DIGlobalVariableExpression(var: !1396, expr: !DIExpression())
!1396 = distinct !DIGlobalVariable(name: "STDOUT_FILENO", linkageName: "STDOUT_FILENO", scope: !1048, file: !1048, line: 118, type: !29, isLocal: true, isDefinition: true)
!1397 = !DIGlobalVariableExpression(var: !1398, expr: !DIExpression())
!1398 = distinct !DIGlobalVariable(name: "CLOEXEC", linkageName: "CLOEXEC", scope: !1399, file: !466, line: 674, type: !1400, isLocal: true, isDefinition: true)
!1399 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.c.darwin.O", scope: !466, file: !466, line: 645, elements: !724)
!1400 = !DIBasicType(name: "u25", size: 32, encoding: DW_ATE_unsigned)
!1401 = !DIGlobalVariableExpression(var: !1402, expr: !DIExpression())
!1402 = distinct !DIGlobalVariable(name: "NONBLOCK", linkageName: "NONBLOCK", scope: !1399, file: !466, line: 654, type: !29, isLocal: true, isDefinition: true)
!1403 = !DIGlobalVariableExpression(var: !1404, expr: !DIExpression())
!1404 = distinct !DIGlobalVariable(name: "SHLOCK", linkageName: "SHLOCK", scope: !1399, file: !466, line: 664, type: !29, isLocal: true, isDefinition: true)
!1405 = !DIGlobalVariableExpression(var: !1406, expr: !DIExpression())
!1406 = distinct !DIGlobalVariable(name: "EXLOCK", linkageName: "EXLOCK", scope: !1399, file: !466, line: 666, type: !29, isLocal: true, isDefinition: true)
!1407 = !DIGlobalVariableExpression(var: !1408, expr: !DIExpression())
!1408 = distinct !DIGlobalVariable(name: "NOCTTY", linkageName: "NOCTTY", scope: !1399, file: !466, line: 683, type: !1409, isLocal: true, isDefinition: true)
!1409 = !DIBasicType(name: "u18", size: 32, encoding: DW_ATE_unsigned)
!1410 = !DIGlobalVariableExpression(var: !1411, expr: !DIExpression())
!1411 = distinct !DIGlobalVariable(name: "RDWR", linkageName: "RDWR", scope: !1399, file: !466, line: 652, type: !29, isLocal: true, isDefinition: true)
!1412 = !DIGlobalVariableExpression(var: !1413, expr: !DIExpression())
!1413 = distinct !DIGlobalVariable(name: "WRONLY", linkageName: "WRONLY", scope: !1399, file: !466, line: 650, type: !29, isLocal: true, isDefinition: true)
!1414 = !DIGlobalVariableExpression(var: !1415, expr: !DIExpression())
!1415 = distinct !DIGlobalVariable(name: "RDONLY", linkageName: "RDONLY", scope: !1399, file: !466, line: 648, type: !29, isLocal: true, isDefinition: true)
!1416 = !DIGlobalVariableExpression(var: !1417, expr: !DIExpression())
!1417 = distinct !DIGlobalVariable(name: "GETFL", linkageName: "GETFL", scope: !1418, file: !466, line: 1556, type: !29, isLocal: true, isDefinition: true)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.c.darwin.F", scope: !466, file: !466, line: 1548, elements: !724)
!1419 = !DIGlobalVariableExpression(var: !1420, expr: !DIExpression())
!1420 = distinct !DIGlobalVariable(name: "SETFL", linkageName: "SETFL", scope: !1418, file: !466, line: 1558, type: !29, isLocal: true, isDefinition: true)
!1421 = !DIGlobalVariableExpression(var: !1422, expr: !DIExpression())
!1422 = distinct !DIGlobalVariable(name: "IFMT", linkageName: "IFMT", scope: !1423, file: !466, line: 1448, type: !363, isLocal: true, isDefinition: true)
!1423 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.c.darwin.S", scope: !466, file: !466, line: 1447, elements: !724)
!1424 = !DIGlobalVariableExpression(var: !1425, expr: !DIExpression())
!1425 = distinct !DIGlobalVariable(name: "IFBLK", linkageName: "IFBLK", scope: !1423, file: !466, line: 1453, type: !819, isLocal: true, isDefinition: true)
!1426 = !DIGlobalVariableExpression(var: !1427, expr: !DIExpression())
!1427 = distinct !DIGlobalVariable(name: "IFCHR", linkageName: "IFCHR", scope: !1423, file: !466, line: 1451, type: !1428, isLocal: true, isDefinition: true)
!1428 = !DIBasicType(name: "u14", size: 16, encoding: DW_ATE_unsigned)
!1429 = !DIGlobalVariableExpression(var: !1430, expr: !DIExpression())
!1430 = distinct !DIGlobalVariable(name: "IFDIR", linkageName: "IFDIR", scope: !1423, file: !466, line: 1452, type: !819, isLocal: true, isDefinition: true)
!1431 = !DIGlobalVariableExpression(var: !1432, expr: !DIExpression())
!1432 = distinct !DIGlobalVariable(name: "IFIFO", linkageName: "IFIFO", scope: !1423, file: !466, line: 1450, type: !1392, isLocal: true, isDefinition: true)
!1433 = !DIGlobalVariableExpression(var: !1434, expr: !DIExpression())
!1434 = distinct !DIGlobalVariable(name: "IFLNK", linkageName: "IFLNK", scope: !1423, file: !466, line: 1455, type: !363, isLocal: true, isDefinition: true)
!1435 = !DIGlobalVariableExpression(var: !1436, expr: !DIExpression())
!1436 = distinct !DIGlobalVariable(name: "IFREG", linkageName: "IFREG", scope: !1423, file: !466, line: 1454, type: !363, isLocal: true, isDefinition: true)
!1437 = !DIGlobalVariableExpression(var: !1438, expr: !DIExpression())
!1438 = distinct !DIGlobalVariable(name: "IFSOCK", linkageName: "IFSOCK", scope: !1423, file: !466, line: 1456, type: !363, isLocal: true, isDefinition: true)
!1439 = !DIGlobalVariableExpression(var: !1440, expr: !DIExpression())
!1440 = distinct !DIGlobalVariable(name: "ns_per_us", linkageName: "ns_per_us", scope: !1225, file: !1225, line: 101, type: !1441, isLocal: true, isDefinition: true)
!1441 = !DIBasicType(name: "u10", size: 16, encoding: DW_ATE_unsigned)
!1442 = !DIGlobalVariableExpression(var: !1443, expr: !DIExpression())
!1443 = distinct !DIGlobalVariable(name: "ns_per_ms", linkageName: "ns_per_ms", scope: !1225, file: !1225, line: 102, type: !1444, isLocal: true, isDefinition: true)
!1444 = !DIBasicType(name: "u20", size: 32, encoding: DW_ATE_unsigned)
!1445 = !DIGlobalVariableExpression(var: !1446, expr: !DIExpression())
!1446 = distinct !DIGlobalVariable(name: "ns_per_s", linkageName: "ns_per_s", scope: !1225, file: !1225, line: 103, type: !1447, isLocal: true, isDefinition: true)
!1447 = !DIBasicType(name: "u30", size: 32, encoding: DW_ATE_unsigned)
!1448 = !DIGlobalVariableExpression(var: !1449, expr: !DIExpression())
!1449 = distinct !DIGlobalVariable(name: "fp_offset", linkageName: "fp_offset", scope: !1450, file: !460, line: 381, type: !29, isLocal: true, isDefinition: true)
!1450 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.debug.StackIterator", scope: !460, file: !460, line: 360, size: 192, align: 64, elements: !1451)
!1451 = !{!1452, !1453}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "first_address", scope: !1450, file: !460, line: 362, baseType: !1197, size: 72, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !1450, file: !460, line: 364, baseType: !713, size: 64, align: 64, offset: 128)
!1454 = !DIGlobalVariableExpression(var: !1455, expr: !DIExpression())
!1455 = distinct !DIGlobalVariable(name: "fp_bias", linkageName: "fp_bias", scope: !1450, file: !460, line: 392, type: !29, isLocal: true, isDefinition: true)
!1456 = !DIGlobalVariableExpression(var: !1457, expr: !DIExpression())
!1457 = distinct !DIGlobalVariable(name: "pc_offset", linkageName: "pc_offset", scope: !1450, file: !460, line: 399, type: !29, isLocal: true, isDefinition: true)
!1458 = !DIGlobalVariableExpression(var: !1459, expr: !DIExpression())
!1459 = distinct !DIGlobalVariable(name: "vtable", linkageName: "vtable", scope: !1460, file: !645, line: 84, type: !1178, isLocal: true, isDefinition: true)
!1460 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.mem.Allocator.gen", scope: !645, file: !645, line: 69, elements: !724)
!1461 = !DIGlobalVariableExpression(var: !1462, expr: !DIExpression())
!1462 = distinct !DIGlobalVariable(name: "native_arch", linkageName: "native_arch", scope: !466, file: !466, line: 5, type: !199, isLocal: true, isDefinition: true)
!1463 = !DIGlobalVariableExpression(var: !1464, expr: !DIExpression())
!1464 = distinct !DIGlobalVariable(name: "default_level", linkageName: "default_level", scope: !453, file: !453, line: 104, type: !452, isLocal: true, isDefinition: true)
!1465 = !DIGlobalVariableExpression(var: !1466, expr: !DIExpression())
!1466 = distinct !DIGlobalVariable(name: "level", linkageName: "level", scope: !453, file: !453, line: 112, type: !452, isLocal: true, isDefinition: true)
!1467 = !DIGlobalVariableExpression(var: !1468, expr: !DIExpression())
!1468 = distinct !DIGlobalVariable(name: "primes", linkageName: "primes", scope: !1469, file: !1469, line: 4, type: !1470, isLocal: true, isDefinition: true)
!1469 = !DIFile(filename: "wyhash.zig", directory: "/Users/jarred/Build/zig/lib/std/hash")
!1470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 320, align: 320, elements: !714)
!1471 = !DIGlobalVariableExpression(var: !1472, expr: !DIExpression())
!1472 = distinct !DIGlobalVariable(name: "free", linkageName: "free", scope: !844, file: !809, line: 747, type: !847, isLocal: true, isDefinition: true)
!1473 = !DIGlobalVariableExpression(var: !1474, expr: !DIExpression())
!1474 = distinct !DIGlobalVariable(name: "slot_free", linkageName: "slot_free", scope: !844, file: !809, line: 753, type: !29, isLocal: true, isDefinition: true)
!1475 = !DIGlobalVariableExpression(var: !1476, expr: !DIExpression())
!1476 = distinct !DIGlobalVariable(name: "free", linkageName: "free", scope: !894, file: !809, line: 747, type: !847, isLocal: true, isDefinition: true)
!1477 = !DIGlobalVariableExpression(var: !1478, expr: !DIExpression())
!1478 = distinct !DIGlobalVariable(name: "slot_free", linkageName: "slot_free", scope: !894, file: !809, line: 753, type: !29, isLocal: true, isDefinition: true)
!1479 = !DIGlobalVariableExpression(var: !1480, expr: !DIExpression())
!1480 = distinct !DIGlobalVariable(name: "free", linkageName: "free", scope: !857, file: !809, line: 747, type: !847, isLocal: true, isDefinition: true)
!1481 = !DIGlobalVariableExpression(var: !1482, expr: !DIExpression())
!1482 = distinct !DIGlobalVariable(name: "slot_free", linkageName: "slot_free", scope: !857, file: !809, line: 753, type: !29, isLocal: true, isDefinition: true)
!1483 = !DIGlobalVariableExpression(var: !1484, expr: !DIExpression())
!1484 = distinct !DIGlobalVariable(name: "IMAGE_NUMBEROF_DIRECTORY_ENTRIES", linkageName: "IMAGE_NUMBEROF_DIRECTORY_ENTRIES", scope: !1485, file: !1485, line: 86, type: !29, isLocal: true, isDefinition: true)
!1485 = !DIFile(filename: "coff.zig", directory: "/Users/jarred/Build/zig/lib/std")
!1486 = !DIGlobalVariableExpression(var: !1487, expr: !DIExpression())
!1487 = distinct !DIGlobalVariable(name: "native_arch", linkageName: "native_arch", scope: !1488, file: !1488, line: 13, type: !199, isLocal: true, isDefinition: true)
!1488 = !DIFile(filename: "windows.zig", directory: "/Users/jarred/Build/zig/lib/std/os")
!1489 = distinct !DISubprogram(name: "std.start.main", scope: !749, file: !749, line: 448, type: !1490, scopeLine: 448, flags: DIFlagStaticMember, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !4, retainedNodes: !1494)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!975, !975, !1492, !1493}
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[*:0]u8", baseType: !731, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*?[*:0]u8", baseType: !731, size: 64, align: 64)
!1494 = !{!1495, !1496, !1497, !1498, !1500}
!1495 = !DILocalVariable(name: "c_argc", arg: 1, scope: !1489, file: !749, line: 448, type: !975)
!1496 = !DILocalVariable(name: "c_argv", arg: 2, scope: !1489, file: !749, line: 448, type: !1492)
!1497 = !DILocalVariable(name: "c_envp", arg: 3, scope: !1489, file: !749, line: 448, type: !1493)
!1498 = !DILocalVariable(name: "env_count", scope: !1499, file: !749, line: 449, type: !713)
!1499 = distinct !DILexicalBlock(scope: !1489, file: !749, line: 448, column: 85)
!1500 = !DILocalVariable(name: "envp", scope: !1499, file: !749, line: 451, type: !1501)
!1501 = !DICompositeType(tag: DW_TAG_structure_type, name: "[][*:0]u8", size: 128, align: 64, elements: !1502)
!1502 = !{!1503, !1504}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1501, baseType: !1492, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1501, baseType: !713, size: 64, align: 64, offset: 64)
!1505 = !DILocation(line: 0, scope: !1489)
!1506 = !DILocation(line: 0, scope: !1499)
!1507 = !DILocation(line: 450, column: 5, scope: !1499)
!1508 = !DILocation(line: 450, column: 18, scope: !1509)
!1509 = !DILexicalBlockFile(scope: !1499, file: !749, discriminator: 2)
!1510 = !DILocation(line: 450, column: 30, scope: !1509)
!1511 = !DILocation(line: 450, column: 52, scope: !1512)
!1512 = !DILexicalBlockFile(scope: !1499, file: !749, discriminator: 4)
!1513 = !DILocalVariable(name: "envp", arg: 3, scope: !1514, file: !749, line: 439, type: !1501)
!1514 = distinct !DISubprogram(name: "std.start.callMainWithArgs", scope: !749, file: !749, line: 439, type: !1515, scopeLine: 439, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !4, retainedNodes: !1518)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!29, !713, !1492, !1517}
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[][*:0]u8", baseType: !1501, size: 64, align: 64)
!1518 = !{!1519, !1520, !1513}
!1519 = !DILocalVariable(name: "argc", arg: 1, scope: !1514, file: !749, line: 439, type: !713)
!1520 = !DILocalVariable(name: "argv", arg: 2, scope: !1514, file: !749, line: 439, type: !1492)
!1521 = !DILocation(line: 0, scope: !1514, inlinedAt: !1522)
!1522 = distinct !DILocation(line: 460, column: 12, scope: !1499)
!1523 = !DILocation(line: 460, column: 72, scope: !1499)
!1524 = !DILocation(line: 440, column: 23, scope: !1525, inlinedAt: !1522)
!1525 = distinct !DILexicalBlock(scope: !1514, file: !749, line: 439, column: 72)
!1526 = !DILocation(line: 441, column: 22, scope: !1525, inlinedAt: !1522)
!1527 = !DILocation(line: 16, column: 5, scope: !1528, inlinedAt: !1542)
!1528 = distinct !DILexicalBlock(scope: !1530, file: !1529, line: 15, column: 29)
!1529 = !DIFile(filename: "main.zig", directory: "/Users/jarred/Build/zig-comptime-debug-repro/src")
!1530 = distinct !DISubprogram(name: "main", scope: !1529, file: !1529, line: 15, type: !1531, scopeLine: 15, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !4, retainedNodes: !1533)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!362}
!1533 = !{!1534, !1538}
!1534 = !DILocalVariable(name: "ab", scope: !1528, file: !1529, line: 16, type: !1535)
!1535 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyComptimeType((struct Options constant))", scope: !1529, file: !1529, line: 6, size: 32, align: 32, elements: !1536)
!1536 = !{!1537}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "foo", scope: !1535, file: !1529, line: 7, baseType: !304, size: 32, align: 32)
!1538 = !DILocalVariable(name: "cd", scope: !1528, file: !1529, line: 19, type: !1539)
!1539 = !DICompositeType(tag: DW_TAG_structure_type, name: "MyComptimeType((struct Options constant))", scope: !1529, file: !1529, line: 6, size: 32, align: 32, elements: !1540)
!1540 = !{!1541}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "foo", scope: !1539, file: !1529, line: 7, baseType: !304, size: 32, align: 32)
!1542 = distinct !DILocation(line: 553, column: 37, scope: !1543, inlinedAt: !1550)
!1543 = distinct !DILexicalBlock(scope: !1544, file: !749, line: 552, column: 24)
!1544 = distinct !DILexicalBlock(scope: !1545, file: !749, line: 537, column: 22)
!1545 = distinct !DISubprogram(name: "std.start.callMain", scope: !749, file: !749, line: 537, type: !1546, scopeLine: 537, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !4, retainedNodes: !1548)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{!29}
!1548 = !{!1549}
!1549 = !DILocalVariable(name: "err", scope: !1543, file: !749, line: 553, type: !362)
!1550 = distinct !DILocation(line: 495, column: 12, scope: !1551, inlinedAt: !1553)
!1551 = distinct !DILexicalBlock(scope: !1552, file: !749, line: 473, column: 41)
